ams/src/DataProcessors/AMS_ПодборТоваров/AMS_ПодборТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_ПодборТоваров</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныДокумент</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦеныСоглашение</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнеПрайса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПродукции</name>
      <type>
        <types>CatalogRef.AMS_Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокКлиента</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокНаш</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прайс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидкиАкция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПродукции</name>
      <type>
        <types>CatalogRef.AMS_Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварКлиента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>EnumRef.AMS_ТоварныйЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Факт1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагСкидка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагСкидкаАкция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДокумент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоглашение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ams/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтролируемаяПартия</name>
    <type>
      <types>CatalogRef.КонтролируемыеПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ams/src/Enums/_ПроизводственныеСмены/_ПроизводственныеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_ПроизводственныеСмены</name>
  <enumValues>
    <name>Дневная</name>
  </enumValues>
  <enumValues>
    <name>Вечерняя</name>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/AMS_Продукция/AMS_Продукция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_Продукция</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Маркер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>EnumRef.AMS_ТоварныйЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прайс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>В2В</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧестныйЗнак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КфцРРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/AMS_Акции/AMS_Акции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_Акции</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Процент скидки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/DataProcessors/AMS_ПодборТоваров/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = "Клиент";

	ТипПродукции = Новый Структура();
	ТипПродукции.Вставить("Химия", Справочники.AMS_Продукция.НайтиПоКоду("001"));
	ТипПродукции.Вставить("Косметика", Справочники.AMS_Продукция.НайтиПоКоду("002"));
	ТипПродукции.Вставить("Моющие", Справочники.AMS_Продукция.НайтиПоКоду("003"));
	ТипПродукции.Вставить("Наборы", Справочники.AMS_Продукция.НайтиПоКоду("044"));
	ТипПродукции.Вставить("ХозТовары", Справочники.AMS_Продукция.НайтиПоКоду("049"));
	ТипПродукции.Вставить("Контракт", Справочники.AMS_Продукция.НайтиПоКоду("039"));

	АдресДанных = Неопределено;
	Если Параметры.Свойство("АдресДанных", АдресДанных) Тогда
		ЗагрузитьИсходнуюТаблицуТовары(АдресДанных);
	КонецЕсли;
	
	Элементы.СтраницаТовары.Видимость = AMS_ВызовСервера.ЭтоKhors();
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Элементы.ПодборДоступно.Видимость          = Ложь;
		Элементы.ХимияДоступно.Видимость           = Ложь;
		Элементы.КосметикаДоступно.Видимость       = Ложь;
		Элементы.МоющиеДоступно.Видимость          = Ложь;
		Элементы.ДеревоНаборыДоступно.Видимость    = Ложь;
		Элементы.ДеревоХозтоварыДоступно.Видимость = Ложь;
		Элементы.КонтрактДоступно.Видимость        = Ложь;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьДанныеФормыПодбора();
	ЗагрузитьТаблицыВыбораТоваров();
	ЗаполнитьКоличествоПалетВес();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр(
			"ru = 'Данные были изменены. Перенести изменения в документ?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	ПоказатьДанныеФормыПодбора();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодбор Тогда
		ПоказатьПодбор();
	Иначе
		ЗагрузитьТаблицыВыбораТоваров();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодбор

&НаКлиенте
Процедура ПодборКоличествоУпаковокПриИзменении(Элемент)
	Стр = Подбор.НайтиПоИдентификатору(Элементы.Подбор.ТекущаяСтрока);
	
	Если Стр.КоличествоУпаковок = 0 Тогда
		ИндексСтроки = Стр.НомерСтроки - 1;
		
		Подбор.Удалить(Подбор.Индекс(Стр));
		
		СчСтрок = 0;
		Для каждого СтрПодбор Из Подбор Цикл
			СчСтрок = СчСтрок + 1;
			СтрПодбор.НомерСтроки = СчСтрок;
		КонецЦикла;
		
		Если ИндексСтроки + 1 > СчСтрок Тогда
			ИндексСтроки = ИндексСтроки - 1;
		КонецЕсли;
		
		Если ИндексСтроки > 0 Тогда
			Элементы.Подбор.ТекущаяСтрока=Подбор[ИндексСтроки].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];

	Стр.Остаток = Стр.Доступно - Стр.КоличествоУпаковок;

	Сумма = Стр.Цена * Стр.КоличествоУпаковок;
	
	Если Стр.ФлагСкидка Тогда
		Стр.Сумма = Сумма - Сумма * Стр.ПроцентРучнойСкидки / 100;
	Иначе
		Стр.Сумма = Сумма; 
	КонецЕсли;
	
	СтрТовары.КоличествоУпаковок = Стр.КоличествоУпаковок;
	СтрТовары.Сумма              = Стр.Сумма;
	
	ЗаполнитьКоличествоПалетВес();
КонецПроцедуры

&НаКлиенте
Процедура ПодборЦенаПриИзменении(Элемент)
	Стр = Подбор.НайтиПоИдентификатору(Элементы.Подбор.ТекущаяСтрока);
	
	Если Стр.Цена = Стр.ЦенаСоглашение Тогда
		Стр.ВидЦены = Стр.ВидЦеныСоглашение;
	Иначе
		Стр.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
	КонецЕсли;	

	СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];

	Сумма = Стр.Цена * Стр.КоличествоУпаковок;
	
	Если Стр.ФлагСкидка Тогда
		Стр.СуммаРучнойСкидки = Сумма * Стр.ПроцентРучнойСкидки / 100;
		Стр.Сумма = Сумма - Стр.СуммаРучнойСкидки;
	Иначе
		Стр.Сумма   = Сумма; 
	КонецЕсли;
	
	СтрТовары.Сумма = Стр.Сумма;
КонецПроцедуры

&НаКлиенте
Процедура ПодборФлагСкидкаПриИзменении(Элемент)
	Стр = Подбор.НайтиПоИдентификатору(Элементы.Подбор.ТекущаяСтрока);
	
	Сумма = Стр.Цена * Стр.КоличествоУпаковок;
	
	Если Стр.ФлагСкидка Тогда
		Стр.Сумма = Сумма - Сумма * Стр.ПроцентРучнойСкидки / 100;
	Иначе
		Стр.Сумма = Сумма; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборПроцентРучнойСкидкиПриИзменении(Элемент)
	Стр = Подбор.НайтиПоИдентификатору(Элементы.Подбор.ТекущаяСтрока);
	
	Сумма = Стр.Цена * Стр.КоличествоУпаковок;
	
	Если Стр.ФлагСкидка Тогда
		Стр.Сумма = Сумма - Сумма * Стр.ПроцентРучнойСкидки / 100;
	Иначе
		Стр.Сумма = Сумма; 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоХимия

&НаКлиенте
Процедура ХимияКоличествоУпаковокПриИзменении(Элемент)
	Стр = ДеревоХимия.НайтиПоИдентификатору(Элементы.ДеревоХимия.ТекущаяСтрока);
	
	Стр.Остаток = Стр.Доступно - Стр.КоличествоУпаковок;
	
	СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];
	
	СтрТовары.КоличествоУпаковок = Стр.КоличествоУпаковок;

	ПоказатьПодбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоКосметика

&НаКлиенте
Процедура КосметикаКоличествоУпаковокПриИзменении(Элемент)
	Стр = ДеревоКосметика.НайтиПоИдентификатору(Элементы.ДеревоКосметика.ТекущаяСтрока);
	
	Стр.Остаток = Стр.Доступно - Стр.КоличествоУпаковок;
	
	СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];
	
	СтрТовары.КоличествоУпаковок = Стр.КоличествоУпаковок;

	ПоказатьПодбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоМоющие

&НаКлиенте
Процедура МоющиеКоличествоУпаковокПриИзменении(Элемент)
	Стр = ДеревоМоющие.НайтиПоИдентификатору(Элементы.ДеревоМоющие.ТекущаяСтрока);
	
	Стр.Остаток = Стр.Доступно - Стр.КоличествоУпаковок;
	
	СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];
	
	СтрТовары.КоличествоУпаковок = Стр.КоличествоУпаковок;

	ПоказатьПодбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоНаборы

&НаКлиенте
Процедура ДеревоНаборыКоличествоУпаковокПриИзменении(Элемент)
	Стр = ДеревоНаборы.НайтиПоИдентификатору(Элементы.ДеревоНаборы.ТекущаяСтрока);
	
	Стр.Остаток = Стр.Доступно - Стр.КоличествоУпаковок;
	
	СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];
	
	СтрТовары.КоличествоУпаковок = Стр.КоличествоУпаковок;

	ПоказатьПодбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоХозтовары

&НаКлиенте
Процедура ДеревоХозтоварыКоличествоУпаковокПриИзменении(Элемент)
	Стр = ДеревоХозтовары.НайтиПоИдентификатору(Элементы.ДеревоХозтовары.ТекущаяСтрока);
	
	Стр.Остаток = Стр.Доступно - Стр.КоличествоУпаковок;
	
	СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];
	
	СтрТовары.КоличествоУпаковок = Стр.КоличествоУпаковок;
	
	ПоказатьПодбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоКонтракт

&НаКлиенте
Процедура КонтрактКоличествоУпаковокПриИзменении(Элемент)
	Стр = ДеревоКонтракт.НайтиПоИдентификатору(Элементы.ДеревоКонтракт.ТекущаяСтрока);
	
	Стр.Остаток = Стр.Доступно - Стр.КоличествоУпаковок;
	
	СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];
	
	СтрТовары.КоличествоУпаковок = Стр.КоличествоУпаковок;
	
	ПоказатьПодбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиТоварыВДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	Парам = Новый Структура("Партнер", Партнер);
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзВнешнегоФайлаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.AMS_ПодборТоваров.Форма.ФормаЗагрузкиИзВнешнегоФайла", Парам,
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзДокументовРеализации(Команда)
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле ""Клиент""",,,,Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Соглашение) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле ""Соглашение""",,,,Отказ);
	КонецЕсли;

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
//	Парам = Новый Структура("АдресДанных", АМС_ВызовСервера.ПоместитьВоВременноеХранилищеТовары(Объект));
//	
//	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.AMS_ФормаДобавленияТовара",Парам,,,,,
//		Новый ОписаниеОповещения("AMS_ОткрытьФормуДобавленияТовараЗавершение",ЭтотОбъект),
//		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзБланкаЗаказа(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок          = "Выберите файл";
	Диалог.Каталог            = "d:\Архив\";
	Диалог.ПолноеИмяФайла     = "";
	Диалог.Фильтр             = "Файлы Excel (*.xls, *.xlsx)|*.xl*";
	Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		Состояние("Загрузка данных их файла EXCEL");
		
		Отказ = Ложь;
		
		МассивСтрок = ПолучитьДанныеИзБланкаЗаказа(Диалог.ПолноеИмяФайла,Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Парам = Новый Структура;
	Парам.Вставить("МассивСтрок", МассивСтрок);
	Парам.Вставить("Партнер", Партнер);

	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзБланкаЗаказаЗавершение", ЭтотОбъект); 
	
	ОткрытьФорму("Обработка.AMS_ПодборТоваров.Форма.ФормаЗагрузкиИзБланкаЗаказа", Парам,
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьИсходнуюТаблицуТовары(АдресДанных)
	УстановитьПривилегированныйРежим(Истина);

	Данные = ПолучитьИзВременногоХранилища(АдресДанных);

	Ссылка = Данные.Ссылка;

	Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Данные.Партнер, "_АртикулКлиента, _АртикулКлиентаПлюс");

	СортироватьПоЗаказу = Стр._АртикулКлиента Или Стр._АртикулКлиентаПлюс;

	МВТ = Новый МенеджерВременныхТаблиц;
	
	ПараметрыМВТ = Новый Структура();
	ПараметрыМВТ.Вставить("ДатаЦены", Данные.ДатаДокумента);
	ПараметрыМВТ.Вставить("МЕГА", Справочники.ЦеновыеГруппы.НайтиПоНаименованию("МЕГА", Истина));
	ПараметрыМВТ.Вставить("Соглашение", Данные.Соглашение);
	//@skip-check bsl-legacy-check-string-literal
	ПараметрыМВТ.Вставить("ВидЦены", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Соглашение, "ВидЦен"));
	ПараметрыМВТ.Вставить("Партнер", Данные.Партнер);
	ПараметрыМВТ.Вставить("ПравилоПродажи", Данные.ПравилоПродажи);
	
	AMS_ВызовСервера.ПолучитьПродукцию(МВТ, ПараметрыМВТ);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;

	Запрос.УстановитьПараметр("ДатаПроизводства",    ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаДокумента",       Данные.ДатаДокумента);
	Запрос.УстановитьПараметр("Проведен",            Данные.Проведен);
	Запрос.УстановитьПараметр("СортироватьПоЗаказу", СортироватьПоЗаказу);
	Запрос.УстановитьПараметр("Товары",              Данные.Товары);
	Запрос.УстановитьПараметр("СкладПродукции",      AMS_ВызовСервера.СкладПродукции());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество,
	|	т.ВидЦены КАК ВидЦены,
	|	т.Сумма КАК Сумма,
	|	т.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки
	|ПОМЕСТИТЬ ЗагрузкаДок
	|ИЗ
	|	&Товары КАК т
	|ГДЕ
	|	т.Количество > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗагрузкаДок.Номенклатура КАК Номенклатура,
	|	ЗагрузкаДок.ВидЦены КАК ВидЦеныДокумент,
	|	СУММА(ЗагрузкаДок.Количество) КАК Количество,
	|	СУММА(ЗагрузкаДок.Сумма) / СУММА(ЗагрузкаДок.Количество) КАК ЦенаДокумент,
	|	СУММА(ЗагрузкаДок.Сумма) КАК Сумма,
	|	МАКСИМУМ(ЗагрузкаДок.ПроцентРучнойСкидки) КАК ПроцентРучнойСкидки
	|ПОМЕСТИТЬ ТовДок
	|ИЗ
	|	ЗагрузкаДок КАК ЗагрузкаДок
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗагрузкаДок.Номенклатура,
	|	ЗагрузкаДок.ВидЦены
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.КоличествоПлан) КАК План1,
	|	СУММА(т.КоличествоФакт) КАК Факт1
	|ПОМЕСТИТЬ Произ1
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	НЕ д.ПометкаУдаления
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаПроизводства, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаПроизводства, ДЕНЬ)
	|	И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.КоличествоПлан) КАК План2,
	|	СУММА(т.КоличествоФакт) КАК Факт2
	|ПОМЕСТИТЬ Произ2
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	НЕ д.ПометкаУдаления
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаПроизводства, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаПроизводства, ДЕНЬ)
	|	И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(т.ВНаличииОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ НаСкладе
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладПродукции) КАК т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(т.ВРезервеОстаток, 0) + ЕСТЬNULL(т.КОтгрузкеОстаток, 0) КАК КОтгрузке
	|ПОМЕСТИТЬ Резерв
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &СкладПродукции) КАК т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Скидка КАК ПроцентРучнойСкидки
	|ПОМЕСТИТЬ Акции
	|ИЗ
	|	Справочник.AMS_Акции КАК д
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Акции.Товары КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	НЕ д.ПометкаУдаления
	|	И НЕ д.ЭтоГруппа
	|	И &ДатаДокумента МЕЖДУ НАЧАЛОПЕРИОДА(д.ДатаНачала, ДЕНЬ) И КОНЕЦПЕРИОДА(д.ДатаОкончания, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.ТипПродукции КАК ТипПродукции,
	|	Товары.ТипПродукцииНаименование КАК ТипПродукцииНаименование,
	|	Товары.НазначениеПродукции КАК НазначениеПродукции,
	|	Товары.НазначениеПродукцииНаименование КАК НазначениеПродукцииНаименование,
	|	Товары.ТоварныйЗнак КАК ТоварныйЗнак,
	|	Товары.ТоварныйЗнакПорядок КАК ТоварныйЗнакПорядок,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Артикул КАК Артикул,
	|	Товары.Прайс КАК Прайс,
	|	Товары.Заказ КАК Заказ,
	|	Товары.ВнеПрайса КАК ВнеПрайса,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.Кфц КАК Кфц,
	|	ВЫБОР
	|		КОГДА &Проведен
	|			ТОГДА (ЕСТЬNULL(НаСкладе.Остаток, 0) - ЕСТЬNULL(Резерв.КОтгрузке, 0) + ЕСТЬNULL(ТовДок.Количество, 0)) / Товары.Кфц
	|		ИНАЧЕ (ЕСТЬNULL(НаСкладе.Остаток, 0) - ЕСТЬNULL(Резерв.КОтгрузке, 0)) / Товары.Кфц
	|	КОНЕЦ КАК Доступно,
	|	ТовДок.Количество / Товары.Кфц КАК КоличествоУпаковок,
	|	ТовДок.Сумма КАК Сумма,
	|	ТовКлиента.ТоварКлиента КАК ТоварКлиента,
	|	Произ1.План1 КАК План1,
	|	Произ1.Факт1 КАК Факт1,
	|	Произ2.План2 КАК План2,
	|	Произ2.Факт2 КАК Факт2,
	|	Товары.ВидЦеныСоглашение КАК ВидЦеныСоглашение,
	|	Товары.ЦенаСоглашение * Товары.Кфц КАК ЦенаСоглашение,
	|	ТовДок.ВидЦеныДокумент КАК ВидЦеныДокумент,
	|	ТовДок.ЦенаДокумент * Товары.Кфц КАК ЦенаДокумент,
	|	Товары.ЦенаСоглашение * Товары.Кфц КАК Цена,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Акции.ПроцентРучнойСкидки, 0) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФлагСкидкаАкция,
	|	ЕСТЬNULL(Акции.ПроцентРучнойСкидки, 0) КАК ПроцентРучнойСкидкиАкция,
	|	ВЫБОР
	|		КОГДА ТовДок.ПроцентРучнойСкидки ЕСТЬ NULL
	|				ИЛИ ТовДок.ПроцентРучнойСкидки = 0
	|			ТОГДА ЕСТЬNULL(Акции.ПроцентРучнойСкидки, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТовДок.ПроцентРучнойСкидки, 0)
	|	КОНЕЦ КАК ПроцентРучнойСкидки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТовДок.ПроцентРучнойСкидки, 0) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ФлагСкидка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТовДок.ПроцентРучнойСкидки, 0) > 0
	|				ИЛИ ЕСТЬNULL(Акции.ПроцентРучнойСкидки, 0) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Флаг,
	|	Товары.Наименование КАК ПорядокНаш,
	|	ВЫБОР
	|		КОГДА &СортироватьПоЗаказу
	|			ТОГДА ВЫБОР
	|					КОГДА НомКлиента.ПорядковыйНомерКлиента ЕСТЬ NULL
	|						ТОГДА Товары.Наименование
	|					ИНАЧЕ НомКлиента.ПорядковыйНомерКлиента
	|				КОНЕЦ
	|		ИНАЧЕ Товары.Наименование
	|	КОНЕЦ КАК ПорядокКлиента
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТовДок КАК ТовДок
	|		ПО Товары.Номенклатура = ТовДок.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТовКлиента КАК ТовКлиента
	|		ПО Товары.Номенклатура = ТовКлиента.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Произ1 КАК Произ1
	|		ПО Товары.Номенклатура = Произ1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Произ2 КАК Произ2
	|		ПО Товары.Номенклатура = Произ2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомКлиента КАК НомКлиента
	|		ПО Товары.Номенклатура = НомКлиента.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаСкладе КАК НаСкладе
	|		ПО Товары.Номенклатура = НаСкладе.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Резерв КАК Резерв
	|		ПО Товары.Номенклатура = Резерв.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Акции КАК Акции
	|		ПО Товары.Номенклатура = Акции.Номенклатура
	|ГДЕ
	|	Товары.Подбор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипПродукцииНаименование,
	|	НазначениеПродукцииНаименование,
	|	ТоварныйЗнакПорядок,
	|	НомерСтроки";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	Объект.Товары.Загрузить(Табл);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеФормыПодбора()
	ПоказатьПодбор();
	ЗагрузитьТаблицыВыбораТоваров();
	УстановитьВидимостьСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодбор()
	Подбор.Очистить();
	
	МассивСтрок = ПолучитьРезультатПодбора();

	НомерСтроки = 0;
	Для Каждого Стр Из МассивСтрок Цикл
		НомерСтроки = НомерСтроки + 1;
		
		НовСтр = Подбор.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
		НовСтр.НомерСтроки = НомерСтроки;
	КонецЦикла;
	
	ЗаполнитьКоличествоПалетВес();
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатПодбора()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("СортироватьПоЗаказу", СортироватьПоЗаказу);
	Запрос.УстановитьПараметр("Проведен", Проведен);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Номенклатура КАК Номенклатура,
		|	т.Артикул КАК Артикул,
		|	т.Упаковка КАК Упаковка,
		|	т.План1 КАК План1,
		|	т.Факт1 КАК Факт1,
		|	т.План2 КАК План2,
		|	т.Факт2 КАК Факт2,
		|	т.Остаток КАК Остаток,
		|	т.Доступно КАК Доступно,
		|	т.КоличествоУпаковок КАК КоличествоУпаковок,
		|	т.ВидЦеныСоглашение КАК ВидЦеныСоглашение,
		|	т.ЦенаСоглашение КАК ЦенаСоглашение,
		|	т.ФлагСкидка КАК ФлагСкидка,
		|	т.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	т.ПроцентРучнойСкидкиАкция КАК ПроцентРучнойСкидкиАкция,
		|	т.Сумма КАК Сумма,
		|	т.ПорядокНаш КАК ПорядокНаш,
		|	т.ПорядокКлиента КАК ПорядокКлиента
		|ПОМЕСТИТЬ Продукция
		|ИЗ
		|	&Товары КАК т
		|ГДЕ
		|	т.КоличествоУпаковок > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Продукция.Номенклатура КАК Номенклатура,
		|	Продукция.Артикул КАК Артикул,
		|	Продукция.Упаковка КАК Упаковка,
		|	Продукция.План1 КАК План1,
		|	Продукция.Факт1 КАК Факт1,
		|	Продукция.План2 КАК План2,
		|	Продукция.Факт2 КАК Факт2,
		|	Продукция.Доступно КАК Доступно,
		|	Продукция.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Продукция.Остаток КАК Остаток,
		|	Продукция.ВидЦеныСоглашение КАК ВидЦены,
		|	Продукция.ЦенаСоглашение КАК Цена,
		|	Продукция.ФлагСкидка КАК ФлагСкидка,
		|	Продукция.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	Продукция.ПроцентРучнойСкидкиАкция КАК ПроцентРучнойСкидкиАкция,
		|	Продукция.Сумма КАК Сумма,
		|	ВЫРАЗИТЬ(Продукция.ПорядокКлиента КАК СТРОКА(50)) КАК ПорядокКлиента,
		|	ВЫРАЗИТЬ(Продукция.ПорядокНаш КАК СТРОКА(50)) КАК ПорядокНаш
		|ИЗ
		|	Продукция КАК Продукция
		|
		|УПОРЯДОЧИТЬ ПО " + ?(СортироватьПоЗаказу, "ПорядокКлиента", "ПорядокНаш");
		
	Табл = Запрос.Выполнить().Выгрузить();
	
	МассивСтрок = Новый Массив();
	
	Для Каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;
	
	Возврат МассивСтрок;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьТаблицыВыбораТоваров()
	ЗагрузитьДеревоТипПродукции(ДеревоХимия, Элементы.ДеревоХимия, ТипПродукции.Химия);
	ЗагрузитьДеревоТипПродукции(ДеревоКосметика, Элементы.ДеревоКосметика, ТипПродукции.Косметика);
	ЗагрузитьДеревоТипПродукции(ДеревоМоющие, Элементы.ДеревоМоющие, ТипПродукции.Моющие);
	ЗагрузитьДеревоТипПродукции(ДеревоНаборы, Элементы.ДеревоНаборы, ТипПродукции.Наборы);
	ЗагрузитьДеревоТипПродукции(ДеревоХозтовары, Элементы.ДеревоХозтовары, ТипПродукции.ХозТовары);
	ЗагрузитьДеревоТипПродукции(ДеревоКонтракт, Элементы.ДеревоКонтракт, ТипПродукции.Контракт);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДеревоТипПродукции(Дерево, ЭлементДерево, Тип)
	Дерево.ПолучитьЭлементы().Очистить();

	НазначениеПродукции = Неопределено; 
	
	СтруктураОтбора = Новый Структура("ТипПродукции", Тип);
	Если Отбор = "Клиент" Тогда
		СтруктураОтбора.Вставить("ТоварКлиента", Истина);
	КонецЕсли;

	СтрокиТипа = Объект.Товары.НайтиСтроки(СтруктураОтбора);

	Для Каждого Стр Из СтрокиТипа Цикл
		Если Не НазначениеПродукции = Стр.НазначениеПродукции Тогда
			Стр1 = Дерево.ПолучитьЭлементы().Добавить();
			Стр1.Номенклатура = Стр.НазначениеПродукции;
			Стр1.Уровень = 1;
			
			Стр2 = Стр1.ПолучитьЭлементы().Добавить();
			Стр2.Номенклатура = Стр.ТоварныйЗнак;
			Стр2.Уровень = 2;
			
			ТоварныйЗнак = Стр.ТоварныйЗнак;

			Стр3 = Стр2.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(Стр3, Стр);
			
			Номенклатура = Стр.Номенклатура;
		КонецЕсли;				
		
		Если ЗначениеЗаполнено(Стр.ТоварныйЗнак) И Не ТоварныйЗнак = Стр.ТоварныйЗнак Тогда
			Стр2 = Стр1.ПолучитьЭлементы().Добавить();
			
			Стр2.Номенклатура = Стр.ТоварныйЗнак;
			Стр2.Уровень = 2;
			
			Стр3 = Стр2.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(Стр3, Стр);
			
			Номенклатура = Стр.Номенклатура;
		КонецЕсли;
		
		Если Не Номенклатура = Стр.Номенклатура Тогда
			Стр3 = Стр2.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(Стр3, Стр);
		КонецЕсли;
		
		Если Проведен Тогда 
			Стр3.Доступно = Стр3.Доступно + Стр3.КоличествоУпаковок;
		КонецЕсли;
		
		Стр3.Остаток = Стр3.Доступно - Стр3.КоличествоУпаковок;

		НазначениеПродукции = Стр.НазначениеПродукции;
		ТоварныйЗнак        = Стр.ТоварныйЗнак;
	КонецЦикла;

	Для каждого Стр1 Из Дерево.ПолучитьЭлементы() Цикл
		ЭлементДерево.Развернуть(Стр1.ПолучитьИдентификатор());
		
		Для каждого Стр2 Из Стр1.ПолучитьЭлементы() Цикл
			ЭлементДерево.Развернуть(Стр2.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраниц()
	НомерСтрокиХимия     = 0;
	НомерСтрокиКосметика = 0;
	НомерСтрокиМоющие    = 0;
	НомерСтрокиНаборы    = 0;
	НомерСтрокиХоз       = 0;
	НомерСтрокиКонтракт  = 0;

	Запрос = Новый Запрос;
	Запрос.установитьПараметр("ТоварыПодбора", Объект.Товары.Выгрузить(, "ТипПродукции, ТоварКлиента"));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	т.ТипПродукции КАК ТипПродукции,
		|	т.ТоварКлиента КАК ТоварКлиента
		|ПОМЕСТИТЬ Продукция
		|ИЗ
		|	&ТоварыПодбора КАК т";
		
	Если Отбор = "Клиент" Тогда Запрос.Текст = Запрос.Текст + "	
		|ГДЕ
		|	т.ТоварКлиента";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	AMS_Продукция.Код КАК Код,
		|	КОЛИЧЕСТВО(Продукция.ТоварКлиента) КАК Количество
		|ИЗ
		|	Продукция КАК Продукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция КАК AMS_Продукция
		|		ПО Продукция.ТипПродукции = AMS_Продукция.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	AMS_Продукция.Код";
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		Если Выб.Код = "001" Тогда
			НомерСтрокиХимия = Выб.Количество;
		КонецЕсли;
		
		Если Выб.Код = "002" Тогда
			НомерСтрокиКосметика = Выб.Количество;
		КонецЕсли;
		
		Если Выб.Код = "003" Тогда
			НомерСтрокиМоющие    = Выб.Количество;
		КонецЕсли;
		
		Если Выб.Код = "044" Тогда
			НомерСтрокиНаборы    = Выб.Количество;
		КонецЕсли;

		Если Выб.Код = "049" Тогда
			НомерСтрокиХоз       = Выб.Количество;
		КонецЕсли;
		
		Если Выб.Код = "039" Тогда
			НомерСтрокиКонтракт  = Выб.Количество;
		КонецЕсли;
	КонецЦикла;

	Элементы.СтраницаБытоваяХимия.Заголовок = "1. Бытовая химия (" + НомерСтрокиХимия + ")";
	Элементы.СтраницаКосметика.Заголовок    = "2. Косметика (" + НомерСтрокиКосметика + ")";
	Элементы.СтраницаПрофХимия.Заголовок    = "3. Проф. химия (" + НомерСтрокиМоющие + ")";
	Элементы.СтраницаНаборы.Заголовок       = "4. Наборы (" + НомерСтрокиНаборы + ")";
	Элементы.СтраницаХозТовары.Заголовок    = "5. Хозтовары (" + НомерСтрокиХоз + ")";
	Элементы.СтраницаКонтракт.Заголовок     = "6. Контракт (" + НомерСтрокиКонтракт + ")";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоПалетВес()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить(, "Номенклатура, КоличествоУпаковок"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.КоличествоУпаковок > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.КоличествоУпаковок * Ном.КоэффициентЕдиницыДляОтчетов КАК Количество
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО вт.Номенклатура = Ном.Ссылка";
	
	Табл = Запрос.Выполнить().Выгрузить();

	Элементы.СтраницаПодбор.Заголовок = "Товары (" + Табл.Количество() + ")";

	Стр = AMS_Сервер.ПолучитьВесОбъемТоваров(Табл);
	
	Вес             = Стр.Вес;
	КоличествоПалет = Стр.КоличествоПалетМоно + Стр.КоличествоПалетСборных;
	
	Если КоличествоПалет > 0 Тогда 
		Элементы.КоличетсвоПалет.Заголовок = "Количество палет: " + Формат(КоличествоПалет, "ЧДЦ=0; ЧФ=""Ч шт.""");
	Иначе		
		Элементы.КоличетсвоПалет.Заголовок = "";
	КонецЕсли;
	
	Если Вес > 0 Тогда 
		Элементы.Вес.Заголовок = "Вес: " + Формат(Стр.Вес, "ЧДЦ=3; ЧФ=""Ч т.""");
	Иначе		
		Элементы.Вес.Заголовок = "";
	КонецЕсли;
	
	ЛогистическийЛист = AMS_ВызовСервера.ПолучитьЛогистическийЛист(Ссылка);
	
	Если Не ЛогистическийЛист = Неопределено Тогда
		Стр = ПолучитьВозможностиЗагрузки(ЛогистическийЛист, Ссылка);
		
		ПерегрузПал = КоличествоПалет - Стр.КоличествоПалет;
		ПерегрузВес = Вес - Стр.Вес;

		Если ПерегрузПал > 0 Или ПерегрузВес > 0.01 Тогда
			Элементы.Перегруз.Видимость             = Истина;
			Элементы.ПеренестиВДокумент.Доступность = Ложь;
			Элементы.Перегруз.Заголовок = "Перегруз транспортного средства " + Стр.ТранспортноеСредство + ": "
				+ ?(ПерегрузПал > 0, "палет на " + ПерегрузПал + " шт.", "")
				+ ?(ПерегрузПал > 0 И ПерегрузВес > 0, ", ", "")
				+ ?(ПерегрузВес > 0, "вес на " + Формат(ПерегрузВес, "ЧДЦ=3; ЧФ=""Ч т."""), "");
		Иначе
			Элементы.Перегруз.Видимость             = Ложь;
			Элементы.ПеренестиВДокумент.Доступность = Истина;
			Элементы.Перегруз.Заголовок = "";
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВозможностиЗагрузки(ЛогистическийЛист, Распоряжение)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛогистическийЛист", ЛогистическийЛист);
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ авто
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|ГДЕ
	|	т.Ссылка = &ЛогистическийЛист
	|	И т.Распоряжение = &Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	авто.ТранспортноеСредство КАК ТранспортноеСредство,
	|	авто.ТранспортноеСредство.ГрузоподъемностьВТоннах КАК ВесАвто,
	|	авто.ТранспортноеСредство.AMS_КоличествоПалет КАК КоличествоПалетАвто,
	|	СУММА(ВЫБОР
	|		КОГДА Распоряжения.Распоряжение = &Распоряжение
	|			ТОГДА 0
	|		ИНАЧЕ Распоряжения.Распоряжение.AMS_Вес
	|	КОНЕЦ) КАК Вес,
	|	СУММА(ВЫБОР
	|		КОГДА Распоряжения.Распоряжение = &Распоряжение
	|			ТОГДА 0
	|		ИНАЧЕ Распоряжения.Распоряжение.AMS_КоличествоПалет
	|	КОНЕЦ) КАК КоличествоПалет
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	авто КАК авто
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист.Распоряжения КАК Распоряжения
	|		ПО авто.Ссылка = Распоряжения.Ссылка
	|		И авто.ТранспортноеСредство = Распоряжения.ТранспортноеСредство
	|СГРУППИРОВАТЬ ПО
	|	авто.ТранспортноеСредство,
	|	авто.ТранспортноеСредство.ГрузоподъемностьВТоннах,
	|	авто.ТранспортноеСредство.AMS_КоличествоПалет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.ТранспортноеСредство КАК ТранспортноеСредство,
	|	вт.ВесАвто - вт.Вес КАК Вес,
	|	вт.КоличествоПалетАвто - вт.КоличествоПалет КАК КоличествоПалет
	|ИЗ
	|	вт КАК вт";
	
	 Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ПеренестиТоварыВДокумент();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварыВДокумент()
	// Снятие модифицированности, т.к. перед закрытием признак проверяется.
	Модифицированность = Ложь;

	Данные = ПолучитьМассивСтрок();

	Закрыть(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОчиститьСообщения();

	Для каждого Стр Из Результат Цикл
		СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];
		
		Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
		
		СтрТовары.КоличествоУпаковок = Стр.Количество / Кфц;
		СтрТовары.Сумма = СтрТовары.КоличествоУпаковок * СтрТовары.Цена;
	КонецЦикла;
	
	ПоказатьДанныеФормыПодбора();
КонецПроцедуры

//Желательно использовать эту процедуру
//@skip-check module-unused-method
&НаКлиенте
Процедура НайтиСтрокуДерева(КоллекцияЭлементовДерева, Номенклатура, ИдентификаторСтроки, ПрекратитьПоиск)
	Для каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		Если ПрекратитьПоиск Тогда
			Возврат;
		КонецЕсли;
		
		Если СтрокаДерева.Номенклатура = Номенклатура Тогда
			ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
			ПрекратитьПоиск = Истина;
			Возврат;
		КонецЕсли;
		
		КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();

		Если КоллекцияЭлементов.Количество() > 0 Тогда
			НайтиСтрокуДерева(КоллекцияЭлементов, Номенклатура, ИдентификаторСтроки, ПрекратитьПоиск);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрок()
	Таб = РеквизитФормыВЗначение("Подбор");

	Табл = Таб.СкопироватьКолонки("Номенклатура, Упаковка, КоличествоУпаковок, Цена, Сумма, ВидЦены, ПроцентРучнойСкидки");

	Для Каждого Стр Из Таб Цикл
		НовСтр = Табл.Добавить();

		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		
		Если Не Стр.ФлагСкидка Тогда
			НовСтр.ПроцентРучнойСкидки = 0;
		КонецЕсли;
	КонецЦикла;

	МассивСтрок = Новый Массив;
	Для Каждого Стр Из Табл Цикл
		МассивСтрок.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	// Таблица значений Подбор
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодборФлагСкидка.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодборПроцентРучнойСкидки.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Подбор.ПроцентРучнойСкидкиАкция");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодборКоличествоУпаковок.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПодборДоступно.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Подбор.КоличествоУпаковок");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Подбор.Доступно");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);

	// ДеревоХимия
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоХимия.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоХимия.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоХимия.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоХимия.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ХимияКоличествоУпаковок.Имя);
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоХимия.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоХимия.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ХимияКоличествоУпаковок.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ХимияДоступно.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоХимия.КоличествоУпаковок");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоХимия.Доступно");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);

	// ДеревоКосметика
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоКосметика.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКосметика.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоКосметика.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКосметика.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КосметикаКоличествоУпаковок.Имя);
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКосметика.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКосметика.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КосметикаКоличествоУпаковок.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КосметикаДоступно.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКосметика.КоличествоУпаковок");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоКосметика.Доступно");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);

	// ДеревоМоющие
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоМоющие.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоМоющие.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоМоющие.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоМоющие.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МоющиеКоличествоУпаковок.Имя);
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоМоющие.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоМоющие.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МоющиеКоличествоУпаковок.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МоющиеДоступно.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоМоющие.КоличествоУпаковок");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоМоющие.Доступно");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);

	// ДеревоХозтовары
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоХозтовары.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоХозтовары.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоХозтовары.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНаборы.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНаборыКоличествоУпаковок.Имя);
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоХозтовары.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоХозтовары.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоХозтоварыКоличествоУпаковок.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоХозтоварыДоступно.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоХозтовары.КоличествоУпаковок");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоХозтовары.Доступно");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);

	// ДеревоНаборы
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНаборы.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНаборы.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНаборы.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНаборы.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНаборыКоличествоУпаковок.Имя);
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНаборы.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНаборы.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);	

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНаборыКоличествоУпаковок.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНаборыДоступно.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНаборы.КоличествоУпаковок");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоНаборы.Доступно");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);

	// ДеревоКонтракт
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоКонтракт.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКонтракт.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоКонтракт.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКонтракт.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,9,Истина));
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КонтрактКоличествоУпаковок.Имя);
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКонтракт.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКонтракт.Уровень");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаШапкиОтчета);
	
	Если Не ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КонтрактКоличествоУпаковок.Имя);
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КонтрактДоступно.Имя);
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоКонтракт.КоличествоУпаковок");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
		ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоКонтракт.Доступно");
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтрицательногоЧисла);
	КонецЕсли;
КонецПроцедуры

#Область ЗагрузкаИзБланкаЗаказа

&НаКлиенте
Функция ПолучитьДанныеИзБланкаЗаказа(ИмяФайла, Отказ) Экспорт
	ВыбФайл = Новый Файл(ИмяФайла);
	Если Не ВыбФайл.Существует() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Файл не существует!");
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.Visible       = Ложь;
		Excel.DisplayAlerts = Ложь;
		Excel.WorkBooks.Open(ИмяФайла);
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка. Возможно неверно указан номер листа книги Excel.");
		Возврат Неопределено;
	КонецПопытки;

	ExcelЛист.Unprotect("Sergik");

	ВсегоСтрок = ExcelЛист.Cells(1, 1).SpecialCells(11).Row;
	ВсегоКолонок = ExcelЛист.UsedRange.Columns.Count();
	
	Если ВсегоКолонок = 18 Или ВсегоКолонок = 19 Или ВсегоКолонок >= 21 Тогда
		Если ВсегоКолонок = 18 Тогда
			КолонкаКодТовара  = 6;
			КолонкаКоличество = 14;
			
		ИначеЕсли ВсегоКолонок = 19 Тогда
			КолонкаКодТовара = 7;
			КолонкаКоличество = 15;
			
		ИначеЕсли ВсегоКолонок >= 21 Тогда
			КолонкаКодТовара = 2;
			КолонкаКоличество = 16;
		КонецЕсли;

		МассивКодТовара  = ExcelЛист.Range(ExcelЛист.Cells(10, КолонкаКодТовара), ExcelЛист.Cells(ВсегоСтрок, КолонкаКодТовара)).Value.Выгрузить()[0];
		МассивКоличество = ExcelЛист.Range(ExcelЛист.Cells(10, КолонкаКоличество), ExcelЛист.Cells(ВсегоСтрок, КолонкаКоличество)).Value.Выгрузить()[0];
		
	Иначе 
		КолонкаКодТовара  = 2;
		КолонкаКоличество = 15;
		
		МассивКодТовара  = ExcelЛист.Range(ExcelЛист.Cells(9, КолонкаКодТовара), ExcelЛист.Cells(ВсегоСтрок, КолонкаКодТовара)).Value.Выгрузить()[0];
		МассивКоличество = ExcelЛист.Range(ExcelЛист.Cells(9, КолонкаКоличество), ExcelЛист.Cells(ВсегоСтрок, КолонкаКоличество)).Value.Выгрузить()[0];
	КонецЕсли;

	Excel.WorkBooks.Close();
	Excel.Quit();
	Excel.DisplayAlerts = Истина;

	МассивСтрок = Новый Массив;

	Индекс = МассивКоличество.Количество() - 1;
	Для Сч = 0 По Индекс Цикл
		КодТовара = МассивКодТовара[Сч];
		
		Если КодТовара = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Количество = МассивКоличество[Сч];

		Если Не (Количество = Неопределено Или Количество = "") И Количество > 0 Тогда
			МассивСтрок.Добавить(Новый Структура("КодТовара,Количество", КодТовара, Количество));

			Если Не Количество = Цел(Количество) Тогда
				Номенклатура = AMS_ВызовСервера.ПолучитьНоменклатуруПоКоду(КодТовара);
				ОбщегоНазначенияКлиент.СообщитьПользователю("Для товара """ + Номенклатура
					+ """ указано не целое количество упаковок (" + Окр(Количество, 3) + ").", , , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзБланкаЗаказаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОчиститьСообщения();

	Для каждого Стр Из Результат Цикл
		СтрТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура))[0];
		
		Кфц = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КоэффициентЕдиницыДляОтчетов");
		
		СтрТовары.КоличествоУпаковок = Стр.Количество / Кфц;
		СтрТовары.Сумма = СтрТовары.КоличествоУпаковок * СтрТовары.Цена;
	КонецЦикла;
	
	ПоказатьДанныеФормыПодбора();
КонецПроцедуры

#КонецОбласти

#КонецОбласти
